
import { ThemedView } from '@/components/themed-view';
import { ThemedText } from '@/components/themed-text';
import { StyleSheet, ScrollView } from 'react-native';

export default function TermsScreen() {
  return (
    <ScrollView>
      <ThemedView style={styles.container}>
        <ThemedText style={styles.title}>شروط الخدمة</ThemedText>
        <ThemedText style={styles.termsText}>
          مرحبًا بك في تطبيق العفاسي. باستخدامك لهذا التطبيق، فإنك توافق على الالتزام بشروط وأحكام الاستخدام التالية. يرجى قراءة هذه الشروط بعناية.
          {"\n\n"}
          1. **وصف الخدمة:** يتيح لك هذا التطبيق الاستماع وتحميل تلاوات القرآن الكريم للشيخ مشاري راشد العفاسي. يتم توفير قائمة السور والملفات الصوتية عبر خدمة `api.alquran.cloud`.
          {"\n\n"}
          2. **استخدام المحتوى:** الملفات الصوتية مخصصة للاستخدام الشخصي وغير التجاري فقط. أنت مسؤول عن أي رسوم بيانات يتم تكبدها عند تحميل أو بث الملفات الصوتية.
          {"\n\n"}
          3. **الملكية الفكرية:** النص القرآني والتلاوات الصوتية هي ملكية فكرية لأصحابها. تصميم التطبيق والبرمجة والرسومات مملوكة لمطور التطبيق. الاستنساخ محظور.
          {"\n\n"}
          4. **التخزين المحلي:** يقوم التطبيق بتخزين الملفات الصوتية التي تم تنزيلها على مساحة التخزين المحلية بجهازك. سيؤدي استخدام وظيفة "حذف الكل" إلى إزالة هذه الملفات نهائيًا من جهازك. نحن غير مسؤولين عن أي فقدان للبيانات.
          {"\n\n"}
          5. **إخلاء المسؤولية عن الضمان:** يتم توفير التطبيق ومحتواه "كما هو" دون أي ضمانات من أي نوع. نحن لا نضمن دقة المحتوى أو توقيته أو توفره أو أن التطبيق سيكون خاليًا من الأخطاء.
          {"\n\n"}
          6. **تحديد المسؤولية:** لن نكون مسؤولين بأي حال من الأحوال عن أي خسارة أو ضرر بما في ذلك، على سبيل المثال لا الحصر، الخسارة أو الضرر غير المباشر أو التبعي، أو أي خسارة أو ضرر من أي نوع ينشأ عن فقدان البيانات أو الأرباح الناشئة عن، أو فيما يتعلق بـ، استخدام هذا التطبيق.
          {"\n\n"}
          7. **التغييرات على الشروط:** نحتفظ بالحق في تعديل هذه الشروط في أي وقت. استمرارك في استخدام التطبيق بعد أي تغييرات من هذا القبيل يشكل موافقتك على الشروط الجديدة.
        </ThemedText>
      </ThemedView>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    flex: 1,
    padding: 20,
  },
  title: {
    fontSize: 24,
    fontWeight: 'bold',
    marginBottom: 20,
    textAlign: 'center',
  },
  termsText: {
    fontSize: 16,
    lineHeight: 24,
  },
});
